Masmiseim36/nxpSDK/boards/sln_vizn3d_iot/demo_apps/hello_world/cm7/pin_mux.h
/* GPIO_EMC_B2_01 (coord K4), SEMC_D17/U25[4] */
/* Routed pin properties */
#define BOARD_INITRGBLEDPINS_GREEN_LED_PERIPHERAL                          GPIO2   /*!< Peripheral name */
#define BOARD_INITRGBLEDPINS_GREEN_LED_SIGNAL                        gpio_mux_io   /*!< Signal name */
#define BOARD_INITRGBLEDPINS_GREEN_LED_CHANNEL                               11U   /*!< Signal channel */

/* GPIO_EMC_B2_00 (coord K2), SEMC_D16/U25[2] */
/* Routed pin properties */
#define BOARD_INITRGBLEDPINS_RED_LED_PERIPHERAL                            GPIO2   /*!< Peripheral name */
#define BOARD_INITRGBLEDPINS_RED_LED_SIGNAL                          gpio_mux_io   /*!< Signal name */
#define BOARD_INITRGBLEDPINS_RED_LED_CHANNEL                                 10U   /*!< Signal channel */

/* GPIO_EMC_B2_02 (coord K3), SEMC_D18/U25[5] */
/* Routed pin properties */
#define BOARD_INITRGBLEDPINS_BLUE_LED_PERIPHERAL                           GPIO2   /*!< Peripheral name */
#define BOARD_INITRGBLEDPINS_BLUE_LED_SIGNAL                         gpio_mux_io   /*!< Signal name */
#define BOARD_INITRGBLEDPINS_BLUE_LED_CHANNEL                                12U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitRGBLedPins(void);              /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitParallelCameraPins(void);      /* Function assigned for the Cortex-M7F */

/* GPIO_AD_00 (coord N12), SIM1_TRXD/J44[C7]/J57[9]/CTP_INT/J48[29]/J25[15]/J9[14] */
/* Routed pin properties */
#define BOARD_INITFLEXIOCAMERAPINS_MCLK_PERIPHERAL                       FLEXIO2   /*!< Peripheral name */
#define BOARD_INITFLEXIOCAMERAPINS_MCLK_SIGNAL                                IO   /*!< Signal name */
#define BOARD_INITFLEXIOCAMERAPINS_MCLK_CHANNEL                               0U   /*!< Signal channel */

/* GPIO_AD_01 (coord R14), SIM1_CLK/J44[C3]/J57[7]/CTP_RST_B/J48[28]/J10[4]/J25[13] */
/* Routed pin properties */
#define BOARD_INITFLEXIOCAMERAPINS_PIXCLK_PERIPHERAL                     FLEXIO2   /*!< Peripheral name */
#define BOARD_INITFLEXIOCAMERAPINS_PIXCLK_SIGNAL                              IO   /*!< Signal name */
#define BOARD_INITFLEXIOCAMERAPINS_PIXCLK_CHANNEL                             1U   /*!< Signal channel */

/* GPIO_AD_02 (coord R13), SIM1_RST/J57[5]/J44[C2]/LCD_RST_B/J48[21]/J25[11]/J10[6] */
/* Routed pin properties */
#define BOARD_INITFLEXIOCAMERAPINS_HSYNC_PERIPHERAL                      FLEXIO2   /*!< Peripheral name */
#define BOARD_INITFLEXIOCAMERAPINS_HSYNC_SIGNAL                               IO   /*!< Signal name */
#define BOARD_INITFLEXIOCAMERAPINS_HSYNC_CHANNEL                              2U   /*!< Signal channel */

/* GPIO_DISP_B2_14 (coord A7), INT2_COMBO/CSI_RST_B */
/* Routed pin properties */
#define BOARD_INITFLEXIOCAMERAPINS_VSYNC_PERIPHERAL                        GPIO5   /*!< Peripheral name */
#define BOARD_INITFLEXIOCAMERAPINS_VSYNC_SIGNAL                      gpio_mux_io   /*!< Signal name */
#define BOARD_INITFLEXIOCAMERAPINS_VSYNC_CHANNEL                             15U   /*!< Signal channel */

/* GPIO_SD_B2_04 (coord F14), FlexSPI_B_CLK/U21[B1] */
/* Routed pin properties */
#define BOARD_INITFLEXIOCAMERAPINS_PWDN_PERIPHERAL                        GPIO10   /*!< Peripheral name */
#define BOARD_INITFLEXIOCAMERAPINS_PWDN_SIGNAL                           gpio_io   /*!< Signal name */
#define BOARD_INITFLEXIOCAMERAPINS_PWDN_CHANNEL                              13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITFLEXIOCAMERAPINS_PWDN_GPIO                              GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITFLEXIOCAMERAPINS_PWDN_GPIO_PIN                             13U   /*!< GPIO pin number */
#define BOARD_INITFLEXIOCAMERAPINS_PWDN_GPIO_PIN_MASK                (1U << 13U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_15 (coord L2), SEMC_D30/U25[51] */
/* Routed pin properties */
#define BOARD_INITFLEXIOCAMERAPINS_RESET_PERIPHERAL                        GPIO2   /*!< Peripheral name */
#define BOARD_INITFLEXIOCAMERAPINS_RESET_SIGNAL                      gpio_mux_io   /*!< Signal name */
#define BOARD_INITFLEXIOCAMERAPINS_RESET_CHANNEL                             25U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFlexioCameraPins(void);        /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitElcdifRk024hh298LcdPins(void); /* Function assigned for the Cortex-M7F */

/* GPIO_AD_34 (coord J16), 1588_EVENT0_IN/SD1_VSELECT */
/* Routed pin properties */
#define BOARD_INITWIFIPINS_SD1_VSELECT_PERIPHERAL                         USDHC1   /*!< Peripheral name */
#define BOARD_INITWIFIPINS_SD1_VSELECT_SIGNAL                      usdhc_vselect   /*!< Signal name */

/* GPIO_SD_B1_00 (coord B16), SD1_CMD/J15[3]/WIFI_SDIO_CMD/J54[11]/NVCC_SD/U19G[D14] */
/* Routed pin properties */
#define BOARD_INITWIFIPINS_SD1_CMD_PERIPHERAL                             USDHC1   /*!< Peripheral name */
#define BOARD_INITWIFIPINS_SD1_CMD_SIGNAL                              usdhc_cmd   /*!< Signal name */

/* GPIO_AD_35 (coord G17), 1588_EVENT0_OUT/SD_PWREN_B */
/* Routed pin properties */
#define BOARD_INITWIFIPINS_SD_PWREN_B_PERIPHERAL                          GPIO10   /*!< Peripheral name */
#define BOARD_INITWIFIPINS_SD_PWREN_B_SIGNAL                             gpio_io   /*!< Signal name */
#define BOARD_INITWIFIPINS_SD_PWREN_B_CHANNEL                                 2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITWIFIPINS_SD_PWREN_B_GPIO                                GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITWIFIPINS_SD_PWREN_B_GPIO_PIN                                2U   /*!< GPIO pin number */
#define BOARD_INITWIFIPINS_SD_PWREN_B_GPIO_PIN_MASK                   (1U << 2U)   /*!< GPIO pin mask */

