Masmiseim36/nxpSDK/boards/sln_vizn3d_iot/demo_apps/hello_world/cm7/pin_mux.h
/* GPIO_SD_B1_01 (coord D15), SD1_CLK/J15[5]/WIFI_SDIO_CLK/J54[9] */
/* Routed pin properties */
#define BOARD_INITWIFIPINS_SD1_CLK_PERIPHERAL                             USDHC1   /*!< Peripheral name */
#define BOARD_INITWIFIPINS_SD1_CLK_SIGNAL                              usdhc_clk   /*!< Signal name */

/* GPIO_SD_B1_02 (coord C15), SD1_D0/J15[7]/WIFI_SDIO_D0/J54[13]/NVCC_SD/U19G[D14] */
/* Routed pin properties */
#define BOARD_INITWIFIPINS_SD1_D0_PERIPHERAL                              USDHC1   /*!< Peripheral name */
#define BOARD_INITWIFIPINS_SD1_D0_SIGNAL                              usdhc_data   /*!< Signal name */
#define BOARD_INITWIFIPINS_SD1_D0_CHANNEL                                     0U   /*!< Signal channel */

/* GPIO_SD_B1_03 (coord B17), SD1_D1/J15[8]/WIFI_SDIO_D1/J54[15] */
/* Routed pin properties */
#define BOARD_INITWIFIPINS_SD1_D1_PERIPHERAL                              USDHC1   /*!< Peripheral name */
#define BOARD_INITWIFIPINS_SD1_D1_SIGNAL                              usdhc_data   /*!< Signal name */
#define BOARD_INITWIFIPINS_SD1_D1_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_SD_B1_04 (coord B15), SD1_D2/J15[1]/WIFI_SDIO_D2/J54[17] */
/* Routed pin properties */
#define BOARD_INITWIFIPINS_SD1_D2_PERIPHERAL                              USDHC1   /*!< Peripheral name */
#define BOARD_INITWIFIPINS_SD1_D2_SIGNAL                              usdhc_data   /*!< Signal name */
#define BOARD_INITWIFIPINS_SD1_D2_CHANNEL                                     2U   /*!< Signal channel */

/* GPIO_SD_B1_05 (coord A16), SD1_D3/J15[2]/WIFI_SDIO_D3/J54[19] */
/* Routed pin properties */
#define BOARD_INITWIFIPINS_SD1_D3_PERIPHERAL                              USDHC1   /*!< Peripheral name */
#define BOARD_INITWIFIPINS_SD1_D3_SIGNAL                              usdhc_data   /*!< Signal name */
#define BOARD_INITWIFIPINS_SD1_D3_CHANNEL                                     3U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitWiFiPins(void);                /* Function assigned for the Cortex-M7F */

/* GPIO_DISP_B2_08 (coord B5), ENET_CRS_DV/U7[18] */
/* Routed pin properties */
#define BOARD_INITBLUETOOTHQN9090PINS_QN_UART_TX_PERIPHERAL              LPUART8   /*!< Peripheral name */
#define BOARD_INITBLUETOOTHQN9090PINS_QN_UART_TX_SIGNAL                      TXD   /*!< Signal name */

/* GPIO_DISP_B2_09 (coord D8), ENET_RXER/U7[20] */
/* Routed pin properties */
#define BOARD_INITBLUETOOTHQN9090PINS_QN_UART_RX_PERIPHERAL              LPUART8   /*!< Peripheral name */
#define BOARD_INITBLUETOOTHQN9090PINS_QN_UART_RX_SIGNAL                      RXD   /*!< Signal name */

/* GPIO_EMC_B2_03 (coord R1), SEMC_D19/U25[7] */
/* Routed pin properties */
#define BOARD_INITBLUETOOTHQN9090PINS_QN_WAKEUP_PERIPHERAL                 GPIO2   /*!< Peripheral name */
#define BOARD_INITBLUETOOTHQN9090PINS_QN_WAKEUP_SIGNAL               gpio_mux_io   /*!< Signal name */
#define BOARD_INITBLUETOOTHQN9090PINS_QN_WAKEUP_CHANNEL                      13U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBluetoothQn9090Pins(void);     /* Function assigned for the Cortex-M7F */

/* GPIO_SD_B2_05 (coord E14), FlexSPI_A_DQS/U21[C3] */
/* Routed pin properties */
#define BOARD_INITFLEXSPI1PINS_FlexSPI_A_DQS_PERIPHERAL                 FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLEXSPI1PINS_FlexSPI_A_DQS_SIGNAL                FLEXSPI_A_DQS   /*!< Signal name */

/* GPIO_SD_B2_06 (coord F17), FlexSPI_A_SS0/U23[1]/U21[C2] */
/* Routed pin properties */
#define BOARD_INITFLEXSPI1PINS_FlexSPI_A_SS0_PERIPHERAL                 FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLEXSPI1PINS_FlexSPI_A_SS0_SIGNAL              FLEXSPI_A_SS0_B   /*!< Signal name */

/* GPIO_SD_B2_07 (coord G14), FlexSPI_A_CLK/U23[6]/U21[B2] */
/* Routed pin properties */
#define BOARD_INITFLEXSPI1PINS_FlexSPI_A_CLK_PERIPHERAL                 FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLEXSPI1PINS_FlexSPI_A_CLK_SIGNAL               FLEXSPI_A_SCLK   /*!< Signal name */

/* GPIO_SD_B2_08 (coord F15), FlexSPI_A_D0/U23[5]/U21[D3] */
/* Routed pin properties */
#define BOARD_INITFLEXSPI1PINS_FlexSPI_A_D0_PERIPHERAL                  FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLEXSPI1PINS_FlexSPI_A_D0_SIGNAL               FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_SD_B2_09 (coord H15), FlexSPI_A_D1/U23[2]/U21[D2] */
/* Routed pin properties */
#define BOARD_INITFLEXSPI1PINS_FlexSPI_A_D1_PERIPHERAL                  FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLEXSPI1PINS_FlexSPI_A_D1_SIGNAL               FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_SD_B2_10 (coord H14), FlexSPI_A_D2/U23[3]/U21[C4] */
/* Routed pin properties */
#define BOARD_INITFLEXSPI1PINS_FlexSPI_A_D2_PERIPHERAL                  FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLEXSPI1PINS_FlexSPI_A_D2_SIGNAL               FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_SD_B2_11 (coord F16), FlexSPI_A_D3/U23[7]/U21[D4] */
/* Routed pin properties */
#define BOARD_INITFLEXSPI1PINS_FlexSPI_A_D3_PERIPHERAL                  FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLEXSPI1PINS_FlexSPI_A_D3_SIGNAL               FLEXSPI_A_DATA3   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFlexSPI1Pins(void);            /* Function assigned for the Cortex-M7F */

/* GPIO_LPSR_06 (coord P8), I2C6_SDA/J50[11] */
/* Routed pin properties */
#define BOARD_INITCSI3DCAMERAPINS_I2C6_SDA_PERIPHERAL                     LPI2C6   /*!< Peripheral name */
#define BOARD_INITCSI3DCAMERAPINS_I2C6_SDA_SIGNAL                            SDA   /*!< Signal name */

/* GPIO_LPSR_07 (coord R8), I2C6_SCL/J50[12] */
/* Routed pin properties */
#define BOARD_INITCSI3DCAMERAPINS_I2C6_SCL_PERIPHERAL                     LPI2C6   /*!< Peripheral name */
#define BOARD_INITCSI3DCAMERAPINS_I2C6_SCL_SIGNAL                            SCL   /*!< Signal name */

/* GPIO_EMC_B2_08 (coord P1), SEMC_DM2/U25[15] */
/* Routed pin properties */
#define BOARD_INITCSI3DCAMERAPINS_BRIDGE_RESET_PERIPHERAL                  GPIO2   /*!< Peripheral name */
#define BOARD_INITCSI3DCAMERAPINS_BRIDGE_RESET_SIGNAL                gpio_mux_io   /*!< Signal name */
#define BOARD_INITCSI3DCAMERAPINS_BRIDGE_RESET_CHANNEL                       18U   /*!< Signal channel */

/* PMIC_STBY_REQ (coord T9), PMIC_STBY_REQ/U353[6] */
/* Routed pin properties */
#define BOARD_INITCSI3DCAMERAPINS_VDD_1V2_PERIPHERAL                      GPIO13   /*!< Peripheral name */
#define BOARD_INITCSI3DCAMERAPINS_VDD_1V2_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_INITCSI3DCAMERAPINS_VDD_1V2_CHANNEL                             2U   /*!< Signal channel */

