Masmiseim36/nxpSDK/boards/sln_vizn3d_iot/demo_apps/hello_world/cm7/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITCSI3DCAMERAPINS_VDD_1V2_GPIO                            GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITCSI3DCAMERAPINS_VDD_1V2_GPIO_PIN                            2U   /*!< GPIO pin number */
#define BOARD_INITCSI3DCAMERAPINS_VDD_1V2_GPIO_PIN_MASK               (1U << 2U)   /*!< GPIO pin mask */

/* GPIO_SNVS_09 (coord R11), J42[12] */
/* Routed pin properties */
#define BOARD_INITCSI3DCAMERAPINS_AP_LDP_INT_PERIPHERAL                   GPIO13   /*!< Peripheral name */
#define BOARD_INITCSI3DCAMERAPINS_AP_LDP_INT_SIGNAL                      gpio_io   /*!< Signal name */
#define BOARD_INITCSI3DCAMERAPINS_AP_LDP_INT_CHANNEL                         12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITCSI3DCAMERAPINS_AP_LDP_INT_GPIO                         GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITCSI3DCAMERAPINS_AP_LDP_INT_GPIO_PIN                        12U   /*!< GPIO pin number */
#define BOARD_INITCSI3DCAMERAPINS_AP_LDP_INT_GPIO_PIN_MASK           (1U << 12U)   /*!< GPIO pin mask */

/* GPIO_SNVS_06 (coord M9), J42[9] */
/* Routed pin properties */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_PWR_PERIPHERAL                   GPIO13   /*!< Peripheral name */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_PWR_SIGNAL                      gpio_io   /*!< Signal name */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_PWR_CHANNEL                          9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_PWR_GPIO                         GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_PWR_GPIO_PIN                         9U   /*!< GPIO pin number */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_PWR_GPIO_PIN_MASK            (1U << 9U)   /*!< GPIO pin mask */

/* GPIO_SNVS_08 (coord N9), J42[11] */
/* Routed pin properties */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_test_PERIPHERAL                  GPIO13   /*!< Peripheral name */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_test_SIGNAL                     gpio_io   /*!< Signal name */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_test_CHANNEL                        11U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_test_GPIO                        GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_test_GPIO_PIN                       11U   /*!< GPIO pin number */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_test_GPIO_PIN_MASK          (1U << 11U)   /*!< GPIO pin mask */

/* GPIO_SNVS_02 (coord L9), J42[5] */
/* Routed pin properties */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_RST_PERIPHERAL                   GPIO13   /*!< Peripheral name */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_RST_SIGNAL                      gpio_io   /*!< Signal name */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_RST_CHANNEL                          5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_RST_GPIO                         GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_RST_GPIO_PIN                         5U   /*!< GPIO pin number */
#define BOARD_INITCSI3DCAMERAPINS_CAMERA_RST_GPIO_PIN_MASK            (1U << 5U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCsi3DCameraPins(void);         /* Function assigned for the Cortex-M7F */

/* GPIO_LPSR_06 (coord P8), I2C6_SDA/J50[11] */
/* Routed pin properties */
#define BOARD_INITMIPI3DCAMERAPINS_I2C6_SDA_PERIPHERAL                    LPI2C6   /*!< Peripheral name */
#define BOARD_INITMIPI3DCAMERAPINS_I2C6_SDA_SIGNAL                           SDA   /*!< Signal name */

/* GPIO_LPSR_07 (coord R8), I2C6_SCL/J50[12] */
/* Routed pin properties */
#define BOARD_INITMIPI3DCAMERAPINS_I2C6_SCL_PERIPHERAL                    LPI2C6   /*!< Peripheral name */
#define BOARD_INITMIPI3DCAMERAPINS_I2C6_SCL_SIGNAL                           SCL   /*!< Signal name */

/* GPIO_SNVS_09 (coord R11), J42[12] */
/* Routed pin properties */
#define BOARD_INITMIPI3DCAMERAPINS_AP_LDP_INT_PERIPHERAL                  GPIO13   /*!< Peripheral name */
#define BOARD_INITMIPI3DCAMERAPINS_AP_LDP_INT_SIGNAL                     gpio_io   /*!< Signal name */
#define BOARD_INITMIPI3DCAMERAPINS_AP_LDP_INT_CHANNEL                        12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMIPI3DCAMERAPINS_AP_LDP_INT_GPIO                        GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITMIPI3DCAMERAPINS_AP_LDP_INT_GPIO_PIN                       12U   /*!< GPIO pin number */
#define BOARD_INITMIPI3DCAMERAPINS_AP_LDP_INT_GPIO_PIN_MASK          (1U << 12U)   /*!< GPIO pin mask */

/* GPIO_SNVS_02 (coord L9), J42[5] */
/* Routed pin properties */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_RST_PERIPHERAL                  GPIO13   /*!< Peripheral name */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_RST_SIGNAL                     gpio_io   /*!< Signal name */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_RST_CHANNEL                         5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_RST_GPIO                        GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_RST_GPIO_PIN                        5U   /*!< GPIO pin number */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_RST_GPIO_PIN_MASK           (1U << 5U)   /*!< GPIO pin mask */

/* GPIO_SNVS_06 (coord M9), J42[9] */
/* Routed pin properties */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_PWR_PERIPHERAL                  GPIO13   /*!< Peripheral name */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_PWR_SIGNAL                     gpio_io   /*!< Signal name */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_PWR_CHANNEL                         9U   /*!< Signal channel */

