Masmiseim36/nxpSDK/boards/sln_vizn3d_iot/demo_apps/hello_world/cm7/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_PWR_GPIO                        GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_PWR_GPIO_PIN                        9U   /*!< GPIO pin number */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_PWR_GPIO_PIN_MASK           (1U << 9U)   /*!< GPIO pin mask */

/* GPIO_SNVS_08 (coord N9), J42[11] */
/* Routed pin properties */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_test_PERIPHERAL                 GPIO13   /*!< Peripheral name */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_test_SIGNAL                    gpio_io   /*!< Signal name */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_test_CHANNEL                       11U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_test_GPIO                       GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_test_GPIO_PIN                      11U   /*!< GPIO pin number */
#define BOARD_INITMIPI3DCAMERAPINS_CAMERA_test_GPIO_PIN_MASK         (1U << 11U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitMipi3DCameraPins(void);        /* Function assigned for the Cortex-M7F */

/* GPIO_LPSR_08 (coord U8), DMIC_CLK/U41[1]/U44[1]/J50[18] */
/* Routed pin properties */
#define BOARD_INITMICPINS_DMIC_CLK_PERIPHERAL                                MIC   /*!< Peripheral name */
#define BOARD_INITMICPINS_DMIC_CLK_SIGNAL                                    CLK   /*!< Signal name */

/* GPIO_LPSR_09 (coord P5), DMIC_DATA0/U41[5]/J50[20]/LPSPI6_CS0/J26[11] */
/* Routed pin properties */
#define BOARD_INITMICPINS_DMIC_DATA0_PERIPHERAL                              MIC   /*!< Peripheral name */
#define BOARD_INITMICPINS_DMIC_DATA0_SIGNAL                        mic_bitstream   /*!< Signal name */
#define BOARD_INITMICPINS_DMIC_DATA0_CHANNEL                                  0U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitMicPins(void);                 /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B2_19 (coord U2), ENET_RGMII_MDC */
/* Routed pin properties */
#define BOARD_INITMQSPINS_ENET_RGMII_MDC_PERIPHERAL                        GPIO2   /*!< Peripheral name */
#define BOARD_INITMQSPINS_ENET_RGMII_MDC_SIGNAL                      gpio_mux_io   /*!< Signal name */
#define BOARD_INITMQSPINS_ENET_RGMII_MDC_CHANNEL                             29U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitMQSPins(void);                 /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDebugConsolePins(void);        /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
